# 1)განიხილეთ ეს კოდი (რას გამოიტანს):

# name = "vano"   ეს არის დეკლარაცია ანუ ცვლადის შექმნა და ინიციალიზება ანუ ცვლადს აძლევს მნიშვნელობას
# age = 0 ეს არის დეკლარაცია ანუ ცვლადის შექმნა და ინიციალიზება ანუ ცვლადს აძლევს მნიშვნელობას
# # print(name + "best") ეს ტერმინალში გამოიტანს ცვლად names და მიუწერს best ამ შემთხვევაში vanobest

# 2)კომენტარის გამოყენებით ახსენით რა არის კომენტარი + რისთვის გამოიყენება ის ასევე ახსენით რა არის დებაგიგნი

#კომენტარი არის ტეხტი რომელსაც კომპიუტერი აეგნორებს და ჩვენ ვიყენებთ რომ ავხსნათ ამ ხაზში რას ვაკეთებთ 

# 3)რა არის ამ კოდში შეცდომა (რომელ ხაზზე)

# name = "vano"
# surname = motiashvili
# height = 1 86
# print(name + surname - height)

#მეორე ხაზში ბრჭყალები აკლია იმიტომ რომ ტექსტია და ტექსტებს ბრჭყალები მესამეში გამოტოვება შეცდომაა და მეოთხეში string ებს და int ებს ვერ მიუმატებ 



